"""建立地图 + 起点终点 + 障碍物 + 可视化"""

import numpy as np

import matplotlib.pyplot as plt

# ============================================================
# 1. 地图尺寸
# ============================================================

width = 30
height = 20

# 注意：
# Numpy 二维数组格式：

#   grid[row, column]

# 地图中：
#       row -> y轴
#       column -> x轴

# 所以：
#       grid[y, x]

# shape = (height, width)

# 这里得到：
#       20行 x 30列

# 也就是：
#        y = 0~19
#        x = 0~29
    

grid = np.zeros(
    (height, width),
    dtype=int
)

print("Grid shape:", grid.shape)

# ============================================================
# 2. 设置障碍物
# ============================================================

# ------------------------------------------------------------
# 障碍物1：竖直墙
# grid[y, x] 
#
# y = 5~14
# x = 10~12
# ------------------------------------------------------------
grid[5:15, 10:13] = 1


# ------------------------------------------------------------
# 障碍物2：横向墙
#
# y = 4~6
# x = 18~26
# ------------------------------------------------------------
grid[4:7, 18:27] = 1


# ------------------------------------------------------------
# 障碍物3
#
# 再增加一块
# ------------------------------------------------------------
grid[12:15, 18:25] = 1

# ============================================================
# 3. 设置起点和终点
# ============================================================

# 统一：
# point = (x, y)

# 注意：
# 这是几何坐标格式，不是 Numpy 索引格式

start = (2, 2)
goal = (27, 17)

# ============================================================
# 4. 拆出 x 和 y
start_x = start[0]
start_y = start[1]

goal_x = goal[0]
goal_y = goal[1]

print("Start:", start)
print("Goal:", goal)

# ============================================================
# 5. 检查坐标有没有超出地图
# ============================================================

def is_inside_map(point):

    x = point[0]
    y = point[1]

    return (
        0 <= x < width 
        and
        0 <= y < height
    )
print("Start inside map =", is_inside_map(start))

print("Goal inside map =", is_inside_map(goal))

# ============================================================
# 6. 检查是不是障碍物
# ============================================================
def is_obstacle(point):

    x = point[0]
    y = point[1]

    # 重点：
    # point 使用 (x, y)
    # Numpy 使用 grid[row, column]
    # 所以：grid[y, x]  # 注意这里的顺序
    return grid[y, x] == 1

print("Start obstacle =", is_obstacle(start))
print("Goal obstacle =", is_obstacle(goal))

# ============================================================
# 7. 检查起点和终点是否合法
# ============================================================

if not is_inside_map(start):
    raise ValueError("Start is outside the map.")

if not is_inside_map(goal):
    raise ValueError("Goal is outside the map.")

if is_obstacle(start):
    raise ValueError("Start is an obstacle.")

if is_obstacle(goal):
    raise ValueError("Goal is an obstacle.")


# ============================================================
# 8. 可视化地图
# ============================================================

plt.figure(figsize=(10, 7))

# imshow 本质上是在显示矩阵
# 
# grid 中
#          0 = free
#          1 = obstacle

# origin  = 'lower'
#
# 表示让 row=0 出现在图的最下面
# 这样看起来就和普通数学坐标系一致
#           y
#           ↑
#           /
#           + ----→ x


plt.imshow(
    grid, 
    origin='upper'  # numpy 的坐标系是左上角为原点，而matplotlib的imshow默认是左下角为原点，所以需要设置origin='lower'来调整显示
)

# ============================================================
# 9. 绘制起点
# ============================================================

plt.scatter(
    start_x,
    start_y,
    s=120,
    marker='o',
    label='Start',
)

# ============================================================
# 10. 绘制终点
# ============================================================

plt.scatter(
    goal_x,
    goal_y,
    s=120,
    marker='*',
    label='Goal',
)

# ===========================================================
# 11. 坐标轴
# ============================================================

plt.xlim(-0.5, width - 0.5)
plt.ylim(-0.5, height - 0.5)

plt.xlabel('x')
plt.ylabel('y')

plt.title("2D Occupancy Grid")
plt.legend()

plt.grid(True)

plt.tight_layout()

plt.show()

